Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_rst_clk.cpp
  if(NewState == ENABLE){
    temp |= RST_CLK_PLL_CONTROL_PLL_CPU_ON;
  }
  else{
    temp &= ~RST_CLK_PLL_CONTROL_PLL_CPU_ON;
  }
  MDR_RST_CLK->PLL_CONTROL = temp;

#endif
}

/**
  * @brief  RST_CLK_CPU_PLLstatus: CPU_PLL status
  * @param  None
  * @retval enum ErrorStatus: SUCCESS if CPU_PLL output clock is ready, else ERROR
  */
ErrorStatus RST_CLK_CPU_PLLstatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag;

  /* Wait until CPUPLL is ready or time out is occure */
  do
  {
    flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY);
    startCounter++;
  } while ((startCounter < PLLCPUonTimeOut) && (flag == RESET));

  if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

/**
  * @brief  RST_CLK_CPUclkPrescaler: configures the CPU_C3_SEL division factor switch.
  * @param  CPUclkDivValue: specifies the CPU_PLL clock division factor.
  *         @arg RST_CLK_CPUclkDIV1
  *         @arg RST_CLK_CPUclkDIV2
  *         @arg RST_CLK_CPUclkDIV4
  *         @arg RST_CLK_CPUclkDIV8
  *         @arg RST_CLK_CPUclkDIV16
  *         @arg RST_CLK_CPUclkDIV32
  *         @arg RST_CLK_CPUclkDIV64
  *         @arg RST_CLK_CPUclkDIV128
  *         @arg RST_CLK_CPUclkDIV256
  * @retval None
  */
void RST_CLK_CPUclkPrescaler(uint32_t CPUclkDivValue)
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_RST_CLK_CPUclkDIV(CPUclkDivValue));

  temp = MDR_RST_CLK->CPU_CLOCK;
  /* Clear CPU_C3_SEL bits */
  temp &= CPU_C3_SELclr;
  /* Set the CPU_C3_SEL bits */
  temp |= (CPUclkDivValue << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos);
  /* Store the new value */
  MDR_RST_CLK->CPU_CLOCK = temp;
}

/**
  * @brief  RST_CLK_CPUclkSelection: select the CPU clock source.
  * @param  CPU_CLK: specifies the CPU clock source.
  *         @arg RST_CLK_CPUclkHSI
  *         @arg RST_CLK_CPUclkCPU_C3
  *         @arg RST_CLK_CPUclkLSE
  *         @arg RST_CLK_CPUclkLSI
  * @retval None
  */
void RST_CLK_CPUclkSelection(uint32_t CPU_CLK)
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_RST_CPU_CLK(CPU_CLK));

  temp = MDR_RST_CLK->CPU_CLOCK;
  /* Clear CPU_C3_SEL bits */
  temp &= CPU_HCLK_SELclr;
  /* Set the CPU_C3_SEL bits */
  temp |= CPU_CLK;
  /* Store the new value */
  MDR_RST_CLK->CPU_CLOCK = temp;
}

/**
  * @brief  Configures the USB_PLL clock source and multiplication factor.
  * @param  RST_CLK_USB_PLLsource: specifies the PLL entry clock source.
  *         @arg RST_CLK_USB_PLLsrcHSIdiv1: HSI oscillator clock is selected as USB_PLL clock entry
  *         @arg RST_CLK_USB_PLLsrcHSIdiv2: HSI oscillator clock divided by 2 is selected as USB_PLL clock entry
  *         @arg RST_CLK_USB_PLLsrcHSEdiv1: HSE oscillator clock is selected as USB_PLL clock entry
  *         @arg RST_CLK_USB_PLLsrcHSEdiv2: HSE oscillator clock divided by 2 is selected as USB_PLL clock entry
  * @param  RST_CLK_USB_PLLmul: specifies the PLL multiplication factor.
  *         This parameter must be a number between 0 and 15.
  *           @arg RST_CLK_USB_PLLmul1
  *           @arg RST_CLK_USB_PLLmul2
  *           @arg RST_CLK_USB_PLLmul3
  *           @arg RST_CLK_USB_PLLmul4
  *           @arg RST_CLK_USB_PLLmul5
  *           @arg RST_CLK_USB_PLLmul6
  *           @arg RST_CLK_USB_PLLmul7
  *           @arg RST_CLK_USB_PLLmul8
  *           @arg RST_CLK_USB_PLLmul9
  *           @arg RST_CLK_USB_PLLmul10
  *           @arg RST_CLK_USB_PLLmul11
  *           @arg RST_CLK_USB_PLLmul12
  *           @arg RST_CLK_USB_PLLmul13
  *           @arg RST_CLK_USB_PLLmul14
  *           @arg RST_CLK_USB_PLLmul15
  *           @arg RST_CLK_USB_PLLmul16
  * @retval None
  */
void RST_CLK_USB_PLLconfig ( uint32_t RST_CLK_USB_PLLsource,
                         uint32_t RST_CLK_USB_PLLmul )
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_RST_CLK_USB_PLL_SOURCE(RST_CLK_USB_PLLsource));
  assert_param(IS_RST_CLK_USB_PLL_MUL(RST_CLK_USB_PLLmul));

  /* Select USBPLL source */
  temp = MDR_RST_CLK->USB_CLOCK;
  /* Clear USB_C1_SEL bits */
  temp &= USB_C1_SELclr;
  /* Set the USB_C1_SEL bits */
  temp |= RST_CLK_USB_PLLsource;
  /* Store the new value */
  MDR_RST_CLK->USB_CLOCK = temp;

  /* Set USBPLL multiplier */
  temp = MDR_RST_CLK->PLL_CONTROL;
  /* Clear PLLMUL[3:0] bits */
  temp &= PLLUSBmulclr;
  /* Set the PLLMUL[3:0] bits */
  temp |= (RST_CLK_USB_PLLmul << PLLUSBMUL_OFFSET);
  /* Store the new value */
  MDR_RST_CLK->PLL_CONTROL = temp;

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
  if (*(__IO uint32_t *) PLLUSBON_BB) {
    *(__IO uint32_t *) PLLUSBRLD_BB = (uint32_t) 0x01;
    *(__IO uint32_t *) PLLUSBRLD_BB = (uint32_t) 0x00;
  }
#endif

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  if( MDR_RST_CLK->PLL_CONTROL & (RST_CLK_PLL_CONTROL_PLL_USB_ON) ) {
    temp = MDR_RST_CLK->PLL_CONTROL;
    temp |= RST_CLK_PLL_CONTROL_PLL_USB_RLD;
    MDR_RST_CLK->PLL_CONTROL = temp;
    temp &= ~RST_CLK_PLL_CONTROL_PLL_USB_RLD;
    MDR_RST_CLK->PLL_CONTROL = temp;
  }
#endif
}

/**
  * @brief  Select the USBPLL output as input for USB_C3_SEL or bypass the USB_PLL.
  * @param  UsePLL: usage state of the USB_PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RST_CLK_USB_PLLuse ( FunctionalState UsePLL )
{
#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  uint32_t temp = 0;
#endif
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(UsePLL));

#if defined ( USE_MDR1986VE9x ) || defined (USE_MDR1901VC1T) /* for Cortex M3 series */
  *(__IO uint32_t *) USB_C2_SEL_BB = (uint32_t) UsePLL;
#endif // #ifdef USE_MDR1986VE9x /* for Cortex M3 series */

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)

  temp = MDR_RST_CLK->USB_CLOCK;
  /* Form new value */
  if (UsePLL != DISABLE){
    /* Use the USB PLL output as input for USB_C3_SEL
     * by setting the USB_C2_SEL bit in the USB_CLOCK register */
    temp |= (1<< RST_CLK_USB_CLOCK_USB_C2_SEL_Pos);
  }
  else{
    /* Use the USB_C1 output as input for USB_C3_SEL
     * by resetting the USB_C2_SEL bit in the USB_CLOCK register */
    temp &= ~(1<< RST_CLK_USB_CLOCK_USB_C2_SEL_Pos);
  }
  /* Configure USB_CLOCK register with new value */
  MDR_RST_CLK->USB_CLOCK = temp;
#endif
}

/**
  * @brief  Enables or disables the USB_PLL.
  * @param  NewState: new state of the USB_PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RST_CLK_USB_PLLcmd ( FunctionalState NewState )
{
#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  uint32_t temp = 0;
#endif
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
  *(__IO uint32_t *) PLLUSBON_BB = (uint32_t) NewState;
#endif

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)

