Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_rst_clk.cpp
  temp = MDR_RST_CLK->PLL_CONTROL;
  /* Form a new value */
  if( NewState != DISABLE ) {
    temp |= RST_CLK_PLL_CONTROL_PLL_USB_ON;
  }
  else {
    temp &= ~RST_CLK_PLL_CONTROL_PLL_USB_ON;
  }
  MDR_RST_CLK->PLL_CONTROL = temp;
#endif

}

/**
  * @brief  RST_CLK_USB_PLLstatus: USB_PLL status
  * @param  None
  * @retval enum ErrorStatus: SUCCESS if USB_PLL output clock is ready, else ERROR
  */
ErrorStatus RST_CLK_USB_PLLstatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag;

  /* Wait until USBPLL is ready or time out is occure */
  do
  {
    flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLUSBRDY);
    startCounter++;
  } while ((startCounter < PLLUSBonTimeOut) && (flag == RESET));

  if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLUSBRDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

/**
  * @brief  Enables or disables the USB_CLK prescaler.
  * @param  NewState: new state of the USB_CLK prescaler.
  *         @arg ENABLE: USB_C2 divided by 2
  *         @arg DISABLE: USB_C2 not divided
  * @retval None
  */
void RST_CLK_USBclkPrescaler(FunctionalState NewState)
{
#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  uint32_t temp = 0;
#endif
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
   *(__IO uint32_t *) USB_C3_SEL_BB = (uint32_t)NewState;
#endif

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)

  temp = MDR_RST_CLK->USB_CLOCK;

  /* Form new value */
  if (NewState != DISABLE){
    /* Enable the USB prescaler by setting the USB_C3_SEL bit in the USB_CLOCK register */
    temp |= (1<< RST_CLK_USB_CLOCK_USB_C3_SEL_Pos);
  }
  else{
    /* Disable the USB prescaler by resetting the USB_C3_SEL bit in the USB_CLOCK register */
    temp &= ~(1<< RST_CLK_USB_CLOCK_USB_C3_SEL_Pos);
  }
  /* Configure USB_CLOCK register with new value */
  MDR_RST_CLK->USB_CLOCK = temp;
#endif

}

/**
  * @brief  Enables or disables the USB_CLK clock.
  * @param  NewState: new state of the USB_CLK.
  *         @arg ENABLE
  *         @arg DISABLE
  * @retval None
  */
void RST_CLK_USBclkEnable ( FunctionalState NewState )
{
#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  uint32_t temp = 0;
#endif
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
  *(__IO uint32_t *) USB_CLK_EN_BB = (uint32_t) NewState;
#endif

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)

  temp = MDR_RST_CLK->USB_CLOCK;

  /* Form new value */
  if (NewState != DISABLE){
    /* Enable the USB clk by setting the USB_CLK_EN bit in the USB_CLOCK register */
    temp |= (1<< RST_CLK_USB_CLOCK_USB_CLK_EN_Pos);
  }
  else{
    /* Disable the USB clk by resetting the USB_CLK_EN bit in the USB_CLOCK register */
    temp &= ~(1<< RST_CLK_USB_CLOCK_USB_CLK_EN_Pos);
  }
  /* Configure USB_CLOCK register with new value */
  MDR_RST_CLK->USB_CLOCK = temp;
#endif
}

/**
  * @brief  RST_CLK_ADCclkSelection: select the ADC clock source.
  * @param  ADC_CLK: specifies the ADC_C2 clock source.
  *         @arg  RST_CLK_ADCclkCPU_C1
  *         @arg  RST_CLK_ADCclkUSB_C1
  *         @arg  RST_CLK_ADCclkCPU_C2
  *         @arg  RST_CLK_ADCclkUSB_C2
  *         @arg  RST_CLK_ADCclkLSE
  *         @arg  RST_CLK_ADCclkLSI
  *         @arg  RST_CLK_ADCclkHSI_C1
  * @retval None
  */
void RST_CLK_ADCclkSelection(uint32_t ADC_CLK)
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_RST_CLK_ADCclk(ADC_CLK));

  /* Select ADC_CLK source */
  temp = MDR_RST_CLK->ADC_MCO_CLOCK;
  /* Clear ADC_C1,C2 SEL bits */
  temp &= ADC_C12_SELclr;
  /* Set the ADC_C1,C2 SEL bits */
  temp |= ADC_CLK;
  /* Store the new value */
  MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief  RST_CLK_ADCclkPrescaler: configures the ADC_C3_SEL division factor switch.
  * @param  ADCclkDivValue: specifies the ADC_C2 clock division factor.
  *         This parameter must be a number between 0 and 15.
  *           @arg RST_CLK_ADCclkDIV1
  *           @arg RST_CLK_ADCclkDIV2
  *           @arg RST_CLK_ADCclkDIV4
  *           @arg RST_CLK_ADCclkDIV8
  *           @arg RST_CLK_ADCclkDIV16
  *           @arg RST_CLK_ADCclkDIV32
  *           @arg RST_CLK_ADCclkDIV64
  *           @arg RST_CLK_ADCclkDIV128
  *           @arg RST_CLK_ADCclkDIV256
  * @retval None
  */
void RST_CLK_ADCclkPrescaler(uint32_t ADCclkDivValue)
{
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_RST_CLK_ADCclkDivValue(ADCclkDivValue));

  temp = MDR_RST_CLK->ADC_MCO_CLOCK;
  /* Clear ADC_C3_SEL bits */
  temp &= ADC_C3_SELclr;
  /* Set the ADC_C3_SEL bits */
  temp |= ADCclkDivValue<<ADC_C3_SEL_OFFSET;
  /* Store the new value */
  MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief  Enables or disables the ADC_CLK clock.
  * @param  NewState: new state of the ADC_CLK.
  *         @arg ENABLE
  *         @arg DISABLE
  * @retval None
  */
void RST_CLK_ADCclkEnable ( FunctionalState NewState )
{
#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)
  uint32_t temp = 0;
#endif
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
  *(__IO uint32_t *) ADC_CLK_EN_BB = (uint32_t) NewState;
#endif

#if defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T)

  temp = MDR_RST_CLK->ADC_MCO_CLOCK;
  /* Form new value */
  if (NewState != DISABLE){
    /* Enable the ADC CLK by setting the ADC_CLK_EN bit in the ADC_MCO_CLOCK register */
    temp |= RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN;
  }
  else{
    /* Disable the ADC CLK by resetting the ADC_CLK_EN bit in the ADC_MCO_CLOCK register */
    temp &= ~RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN;
  }
  /* Configure CPU_CLOCK register with new value */
  MDR_RST_CLK->ADC_MCO_CLOCK = temp;
#endif

