Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_rst_clk.cpp
  /* Determine CPU_C2 frequency */
  cpu_c2_freq = cpu_c1_freq;

  if (MDR_RST_CLK->CPU_CLOCK & (1 << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos)) {
    /* Determine CPU PLL output frequency */
    pll_mul = ((MDR_RST_CLK->PLL_CONTROL
        >> RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos) & (uint32_t) 0x0F) + 1;
    cpu_c2_freq *= pll_mul;
  }

  /*Select CPU_CLK from HSI, CPU_C3, LSE, LSI cases */
  switch ((MDR_RST_CLK->CPU_CLOCK >> RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
      & (uint32_t) 0x03) {
    case 0:
      /* HSI */
      RST_CLK_Clocks->CPU_CLK_Frequency = HSI_Value;
      break;
    case 1:
      /* CPU_C3 */
      /* Determine CPU_C3 frequency */
      if ((MDR_RST_CLK->CPU_CLOCK >> RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos
          & (uint32_t) 0x08) == 0x00) {
        cpu_c3_freq = cpu_c2_freq;
      }
      else {
        cpu_c3_freq = cpu_c2_freq
            / (1
                << ((MDR_RST_CLK->CPU_CLOCK
                    >> RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos
                    & (uint32_t) 0x07) + 1));
      }
      RST_CLK_Clocks->CPU_CLK_Frequency = cpu_c3_freq;
      break;
    case 2:
      /* LSE */
      RST_CLK_Clocks->CPU_CLK_Frequency = LSE_Value;
      break;
    default: /* case 3 */
      /* LSI */
      RST_CLK_Clocks->CPU_CLK_Frequency = LSI_Value;
      break;
  }

  /* Compute USB_CLK frequency */

  /* Determine USB_C1 frequency */
  if( MDR_RST_CLK->USB_CLOCK & (2 << RST_CLK_USB_CLOCK_USB_C1_SEL_Pos) ) {
    usb_c1_freq = HSE_Value;
  }
  else {
    usb_c1_freq = HSI_Value;
  }

  if( MDR_RST_CLK->USB_CLOCK & (1 << RST_CLK_USB_CLOCK_USB_C1_SEL_Pos) ) {
    usb_c1_freq /= 2;
  }

  /* Determine USB_C2 frequency */
  usb_c2_freq = usb_c1_freq;

  if( MDR_RST_CLK->USB_CLOCK & (1 << RST_CLK_USB_CLOCK_USB_C2_SEL_Pos) ){
    /* Determine USB PLL output frequency */
    pll_mul = ((MDR_RST_CLK->PLL_CONTROL
        >> RST_CLK_PLL_CONTROL_PLL_USB_MUL_Pos) & (uint32_t) 0x0F) + 1;
    usb_c2_freq *= pll_mul;
  }

  /* Determine USB_C3 frequency */
  usb_c3_freq = usb_c2_freq;
  if(MDR_RST_CLK->USB_CLOCK & (1 << RST_CLK_USB_CLOCK_USB_C3_SEL_Pos)){
    usb_c3_freq /= 2;
  }

  RST_CLK_Clocks->USB_CLK_Frequency = usb_c3_freq;

  /* Compute RTCHSI_CLK frequency */
  temp = MDR_RST_CLK->RTC_CLOCK >> RST_CLK_RTC_CLOCK_HSI_SEL_Pos;
  if ((temp & 0x08U) == 0) {
    hsi_c1_freq = HSI_Value;
  }
  else {
    temp = 1 << ((temp & 0x07U) + 1);
    hsi_c1_freq = HSI_Value / temp;
  }
  RST_CLK_Clocks->RTCHSI_Frequency = hsi_c1_freq;

  /* Compute RTCHSE_CLK frequency */
  temp = MDR_RST_CLK->RTC_CLOCK >> RST_CLK_RTC_CLOCK_HSE_SEL_Pos;
  if ((temp & 0x08U) == 0) {
    hse_c1_freq = HSE_Value;
  }
  else {
    temp = 1 << ((temp & 0x07U) + 1);
    hse_c1_freq = HSE_Value / temp;
  }
  RST_CLK_Clocks->RTCHSE_Frequency = hse_c1_freq;

  /* Compute ADC_CLK frequency */

  /* Select ADC_C1 from CPU_C1, LSI, USB_C1, CPU_C2, USB_C2 cases */
  switch ((MDR_RST_CLK->ADC_MCO_CLOCK >> RST_CLK_ADC_MCO_CLOCK_ADC_C1_SEL_Pos)
      & (uint32_t) 0x03) {
    case 0:
      /* CPU_C1 */
      adc_c1_freq = cpu_c1_freq;
      break;
    case 1:
      /* USB_C1 */
      adc_c1_freq = usb_c1_freq;
      break;
    case 2:
      /* CPU_C2 */
      adc_c1_freq = cpu_c2_freq;
      break;
    default: /* case 3 */
      /* USB_C2 */
      adc_c1_freq = usb_c2_freq;
      break;
  }

  /* Select ADC_C2 from LSE, LSI, ADC_C1, HSI_C1 cases */
  switch ((MDR_RST_CLK->ADC_MCO_CLOCK >> RST_CLK_ADC_MCO_CLOCK_ADC_C2_SEL_Pos)
      & (uint32_t) 0x03) {
    case 0:
      /* LSE */
      adc_c2_freq = LSE_Value;
      break;
    case 1:
      /* LSI */
      adc_c2_freq = LSI_Value;
      break;
    case 2:
      /* ADC_C1 */
      adc_c2_freq = adc_c1_freq;
      break;
    default: /* case 3 */
      /* HSI_C1 */
      adc_c2_freq = hsi_c1_freq;
      break;
  }

  temp = MDR_RST_CLK->ADC_MCO_CLOCK >> RST_CLK_ADC_MCO_CLOCK_ADC_C3_SEL_Pos;
  if ((temp & 0x08U) == 0) {
    adc_c3_freq = adc_c2_freq;
  }
  else {
    temp = 1 << ((temp & 0x07U) + 1);
    adc_c3_freq = adc_c2_freq / temp;
  }

  RST_CLK_Clocks->ADC_CLK_Frequency = adc_c3_freq;
}

/**
  * @brief  Checks whether the specified RCC flag is set or not.
  * @param  RST_CLK_FLAG: specifies the flag to check.
  *         This parameter can be one of the following values:
  *           @arg RST_CLK_FLAG_HSIRDY
  *                RST_CLK_FLAG_LSIRDY
  *                RST_CLK_FLAG_HSERDY
  *                RST_CLK_FLAG_LSERDY
  *                RST_CLK_FLAG_PLLCPURDY
  *                RST_CLK_FLAG_PLLUSBRDY
  *                RST_CLK_FLAG_PLLDSPRDY
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
FlagStatus RST_CLK_GetFlagStatus(uint32_t RST_CLK_FLAG)
{
  uint32_t statusreg;
  FlagStatus bitstatus;

  /* Check the parameters */
  assert_param(IS_RST_CLK_FLAG(RST_CLK_FLAG));

  /* Get the register */
  if ((FLAG_SFR_MASK & RST_CLK_FLAG) == (uint32_t)0x20) /* The flag to check is in CLOCK_STATUS register */
  {
    statusreg = MDR_RST_CLK->CLOCK_STATUS;
  }
  else                                                  /* The flag to check is in REG_0F register */
  {
    statusreg = MDR_BKP->REG_0F;
  }

  /* Get the flag status on proper position */
  if ((statusreg & ((uint32_t)1 << (RST_CLK_FLAG & FLAG_MASK))) != (uint32_t)0x00)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  /* Return the flag status */
  return bitstatus;
}

#if defined (USE_MDR1901VC1T)

/**
 * @brief	Select the sourse of DSP_C1 CLOCK.
 * @param	DSP_CLOCK: defines the the clock source of the DSP_C1.
 * 			This parameter can be one of the following values:
 * 				@arg DSP_C1_CLOCK_HSI
 * 				@arg DSP_C1_CLOCK_HSI2
 * 				@arg DSP_C1_CLOCK_HSE
 * 				@arg DSP_C1_CLOCK_HSE2
 * @retval	None
 */
void RST_CLK_DSP_Selection(uint32_t DSP_CLOCK)
{
	uint32_t tmpreg;
	/* Check the parameters */
	assert_param(IS_DSP_C1_CLOCK(DSP_CLOCK));

	tmpreg = MDR_RST_CLK->DSP_CLOCK & (~RST_CLK_DSP_CLOCK_DSP_C1_SEL_Msk);

	tmpreg |= DSP_CLOCK;

	MDR_RST_CLK->DSP_CLOCK = tmpreg;
}


/**
  * @brief	Configures the DSP_PLL multiplication factor.
  * @param	PLLMul: specifies the PLL multiplication factor.
  *         This parameter must be a number between 0 and 15.
  *         	@arg DSP_PLL_MUL1
  *         	@arg DSP_PLL_MUL2
  *         	@arg DSP_PLL_MUL3
  *         	@arg DSP_PLL_MUL4
  *         	@arg DSP_PLL_MUL5
  *         	@arg DSP_PLL_MUL6
  *         	@arg DSP_PLL_MUL7
  *         	@arg DSP_PLL_MUL8
  *         	@arg DSP_PLL_MUL9
  *         	@arg DSP_PLL_MUL10
  *         	@arg DSP_PLL_MUL11
  *         	@arg DSP_PLL_MUL12
  *         	@arg DSP_PLL_MUL13
  *         	@arg DSP_PLL_MUL14
  *         	@arg DSP_PLL_MUL15
  *         	@arg DSP_PLL_MUL16
  * @retval None.
  */
void RST_CLK_DSPPLLConfig(uint32_t DSP_PLL_Mul)
{

	uint32_t tmpreg;
	/* Check the parameters */
	assert_param(IS_DSP_PLL_MULL(DSP_PLL_Mul));

