Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_rst_clk.cpp
	tmpreg = MDR_RST_CLK->PLL_CONTROL & (~RST_CLK_PLL_CONTROL_PLL_DSP_MUL_Msk);

	tmpreg |= DSP_PLL_Mul << RST_CLK_PLL_CONTROL_PLL_DSP_MUL_Pos;

	MDR_RST_CLK->PLL_CONTROL = tmpreg;

	if (*(__IO uint32_t *) PLL_DSP_ON_BB ) {
		*(__IO uint32_t *) PLL_DSP_PLD_BB = (uint32_t) 0x01;
		*(__IO uint32_t *) PLL_DSP_PLD_BB = (uint32_t) 0x00;
	}
}

/**
  * @brief	Enable or disable the DSP PLL.
  * @param	NewState: the new state of the DSP PLL.
  * 			This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RST_CLK_DSPPLL_CMD(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *)PLL_DSP_ON_BB = (uint32_t) NewState;
}

/**
  * @brief  Get DSP_PLL status
  * @param  None
  * @retval enum ErrorStatus: SUCCESS if DSP_PLL output clock is ready, else ERROR.
  */
ErrorStatus RST_CLK_DSP_PLLStatus(void)
{
  __IO uint32_t startCounter = 0;
  ErrorStatus state;
  FlagStatus flag;

  /* Wait until DSPPLL is ready or time out is occure */
  do
  {
    flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLDSPRDY);
    startCounter++;
  } while ((startCounter < PLLDSPonTimeOut) && (flag == RESET));

  if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLDSPRDY) != RESET)
  {
    state = SUCCESS;
  }
  else
  {
    state = ERROR;
  }
  return state;
}

/**
  * @brief	Select the DSP_PLL output as input for DSP_C3_SEL or bypass the CPU_PLL.
  * @param  UsePLL: usage state of the DSP_PLL. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RST_CLK_DSP_PLLUse(FunctionalState UsePLL)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(UsePLL));

	*(__IO uint32_t *) DSP_CLK_C2_SEL_BB = (uint32_t) UsePLL;
}


/**
  * @brief	Use DSP_C2  or DSP_C2/2 output as DSP_CLK.
  * @param	DSP_Prescaler: enables or disables halving the DSP_C2 output clock.
  * 			This parameter can be:
  * 			@arg DSP_PRESCALER1
  * 			@arg DSP_PRESCALER2
  * @retval	None
  */
void RST_CLK_DSPPrescaler(uint32_t DSP_Prescaler)
{
	/* Check the parameters */
	assert_param(IS_DSP_PRESCALER(DSP_Prescaler));

	*(__IO uint32_t *) DSP_CLK_C3_SEL_BB = (uint32_t) DSP_Prescaler;
}

/**
  * @brief	Enable or disable DSP clock.
  * @param	NewState: New state of the DSP CLK.
  * 			This parameter can be: ENABLE or DISABLE.
  * @retval	None
  */
void RST_CLK_DSPCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	/* Set the new  state of the DSP CLK bit */
	*(__IO uint32_t *) DSP_CLK_EN_BB = (uint32_t) NewState;
}

#endif

/** @} */ /* End of group RST_CLK_Private_Functions */

/** @} */ /* End of group RST_CLK */

/** @} */ /* End of group __MDR32F9Qx_StdPeriph_Driver */

/*
*
* END OF FILE MDR32F9Qx_rst_clk.c */

